In [1]:
# https://dplyr.tidyverse.org/reference/context.html
from plyrda.all import *

In [2]:
df = tibble(
  g=['a'] + ['b'] * 2 + ['c'] * 3,
  x=runif(6),
  y=runif(6)
)
gf = df >> group_by(f.g)

gf >> summarise(n = n())

   g  n
0  a  1
1  b  2
2  c  3

In [3]:
gf >> mutate(id=cur_group_id()) >> ungroup()

   g         x         y  id
0  a  0.859386  0.171190   0
1  b  0.956600  0.392866   1
2  b  0.576298  0.774253   1
3  c  0.879491  0.696694   2
4  c  0.529602  0.273560   2
5  c  0.433942  0.209525   2

In [4]:
gf >> summarise(row=cur_group_rows())

   g        row
0  a        [0]
1  b     [1, 2]
2  c  [3, 4, 5]

In [5]:
gf_group = gf >> summarise(data=cur_group())
gf_group

   index       data
0      0     g
0  a
1      1     g
0  b
2      2     g
0  c

In [6]:
gf_group >> pull(f.data, to_list=True)

[   g
 0  a,
    g
 0  b,
    g
 0  c]

In [7]:
gf_data = gf >> summarise(data=cur_data())
gf_data

   index                                               data
0      0                    x        y
0  0.859386  0.17119
1      1            x         y
1  0.956600  0.392866
2 ...
2      2            x         y
3  0.879491  0.696694
4 ...

In [8]:
gf_data >> pull(f.data, to_list=True)

[          x        y
 0  0.859386  0.17119,
           x         y
 1  0.956600  0.392866
 2  0.576298  0.774253,
           x         y
 3  0.879491  0.696694
 4  0.529602  0.273560
 5  0.433942  0.209525]

In [9]:
gf_data_all = gf >> summarise(data=cur_data_all())
gf_data_all

   index                                               data
0      0       g         x        y
0  a  0.859386  0.17119
1      1     g         x         y
1  b  0.956600  0.392...
2      2     g         x         y
3  c  0.879491  0.696...

In [10]:
gf_data_all >> pull(f.data, to_list=True)

[   g         x        y
 0  a  0.859386  0.17119,
    g         x         y
 1  b  0.956600  0.392866
 2  b  0.576298  0.774253,
    g         x         y
 3  c  0.879491  0.696694
 4  c  0.529602  0.273560
 5  c  0.433942  0.209525]

In [11]:
df >> select(f.x, f.y) >> mutate(
    across(
        everything(), 
        lambda x, cc: Series([cc + ' '] * x.shape[0]) + (x**2).astype(str), cc=cur_column()
    )
)

                       x                      y
0   x 0.7385434691893296  y 0.02930609630358856
1   x 0.9150829752552707    y 0.154343553475614
2  x 0.33211978369563816    y 0.599467657223527
3   x 0.7735045776874385   y 0.4853821548748036
4   x 0.2804777997849993  y 0.07483496934923711
5  x 0.18830526394242453  y 0.04390066143642613

In [12]:
# or you can use x.name, since x is a Series
df >> mutate(across(
    [f.x, f.y], 
    lambda x: Series([x.name + ' '] * x.shape[0]) + (x**2).astype(str)
))

   g                      x                      y
0  a   x 0.7385434691893296  y 0.02930609630358856
1  b   x 0.9150829752552707    y 0.154343553475614
2  b  x 0.33211978369563816    y 0.599467657223527
3  c   x 0.7735045776874385   y 0.4853821548748036
4  c   x 0.2804777997849993  y 0.07483496934923711
5  c  x 0.18830526394242453  y 0.04390066143642613